#### DataExchangeMessageVerbosity Enumeration

---

|  |
| --- |
| See Also |

Predefined verbosity levels for DataExchangeLog

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum DataExchangeMessageVerbosity ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DataExchangeMessageVerbosity ``` |

| Visual C++ |
| --- |
| ``` public enum class DataExchangeMessageVerbosity ``` |

# Members

| Member name | Description |
| --- | --- |
| Minimal | Minimal verbosity. Only fatal errors are reported. |
| Default | Default verbosity. Warnings, errors, fatal errors are reported. |
| Verbose | All events are reported. |

# See Also

Autodesk.Revit.DB Namespace